Repository: BasemElgendy95/BGField
Catalog: Sources/BGField/Resources/Localizable.xcstrings
Source language: en
Languages: ar

# field_required
source: This field is required
ar: هذه الخانة مطلوبة

source: Invalid date format
ar: تنسيق التاريخ غير صالح

# invalid_email
source: Invalid email format
ar: تنسيق البريد الإلكتروني غير صالح

source: Invalid number
ar: رقم غير صالح

# invalid_phone
source: Invalid phone number
ar: رقم الهاتف غير صالح

source: Invalid text
ar: نص غير صالح

source: Invalid URL
ar: رابط غير صالح

source: Invalid username
ar: اسم المستخدم غير صالح

# name_too_short
source: Name is too short
ar: الاسم قصير جدًا

source: Optional field
ar: حقل اختياري

# password_lowercase_required
source: Include at least one lowercase letter
ar: يجب تضمين حرف صغير واحد على الأقل

# password_number_required
source: Include at least one number
ar: يجب تضمين رقم واحد على الأقل

# password_required
source: Password is required
ar: كلمة المرور مطلوبة

# password_special_required
source: Include at least one special character
ar: يجب تضمين رمز خاص واحد على الأقل

# password_too_short
source: Password is too short
ar: كلمة المرور قصيرة جدًا

# password_uppercase_required
source: Include at least one uppercase letter
ar: يجب تضمين حرف كبير واحد على الأقل
